// typeScript로 블록 생성 만들기

// 환경 설정 하고

// ts-node 설치

// 설치 명령어
// ------------------------------------------------------
// npm install -D typescript ts-node @types/node
// ------------------------------------------------------

// tsconfig.json 만들기

// ------------------------------------------------------
// tsc --init
// ------------------------------------------------------

// tsconfig.json에서 paths 사용할거라

// 설치 명령어
// ------------------------------------------------------
// npm install -D tsconfig-paths
// ------------------------------------------------------

// 우리가 필요한 모듈 설치

// 머클루트와 해시값이 필요하니까
// crypto-js, merkle 설치

// 설치 명령어
// ------------------------------------------------------
//  npm install crypto-js merkle
// ------------------------------------------------------